Repository: python/pootle-python-org-backup
Catalog: tmxes/ru/reference.tmx
Source language: en
Languages: ru

source: When a name is not found at all, a :exc:`NameError` exception is raised. If the name refers to a local variable that has not been bound, a :exc:`UnboundLocalError` exception is raised. :exc:`UnboundLocalError` is a subclass of :exc:`NameError`.
ru: Когда имя вообще не найдено - вызывается исключение «:exc:`NameError`» . Если это имя указывает на локальную переменную, которая ещё не была связана - вызывается исключение «:exc:`UnboundLocalError`» , которое является подклассом для «:exc:`NameError`» .

source: The following constructs bind names: formal parameters to functions, :keyword:`import` statements, class and function definitions (these bind the class or function name in the defining block), and targets that are identifiers if occurring in an assignment, :keyword:`for` loop header, or after :keyword:`as` in a :keyword:`with` statement or :keyword.`except` clause. The :keyword:`import` statement of the form ``from ... import *`` binds all names defined in the imported module, except those beginning with an underscore. This form may only be used at the module level.
ru: Следующие конструкции назначают имена: формальные параметры функции, инструкция «:keyword:`import`» , определения класса и функции (они назначают имя класса или функции внутри определяющего блока) , и цели назначения, которые являются идентификаторами, когда встречаются в операциях назначения, заголовок цикла «:keyword:`for`» или после «:keyword:`as`» в инструкции «:keyword:`with`» или в выражении «:keyword:`except`» . Инструкция «:keyword:`import`» в форме «``from ... import *``» связывает все имена определённые в импортируемом модуле, за исключением начинающихся со знака подчёркивания. Эта форма может быть использована только на уровне модуля.

source: A target occurring in a :keyword:`del` statement is also considered bound for this purpose (though the actual semantics are to unbind the name). It is illegal to unbind a name that is referenced by an enclosing scope; the compiler will report a :exc:`SyntaxError`.
ru: Цель назначения для инструкции «:keyword:`del`» также считается получившей назначение (хотя в действительности смысл в снятии связи с этого имени) . Не допустимо удалять назначение имени, упоминаемого снаружи данного блока – это приведет к сообщению об ошибке «:exc:`SyntaxError`» на этапе компилирования.

source: Each assignment or import statement occurs within a block defined by a class or function definition or at the module level (the top-level code block).
ru: Любое назначение или импорт действует только в пределах блока класса, функции или модуля (он является самым высокоуровневым блоком кода) .

source: If a name binding operation occurs anywhere within a code block, all uses of the name within the block are treated as references to the current block. This can lead to errors when a name is used within a block before it is bound. This rule is subtle. Python lacks declarations and allows name binding operations to occur anywhere within a code block. The local variables of a code block can be determined by scanning the entire text of the block for name binding operations.
ru: Если операция связывания имени встречается где-либо внутри блока кода, то все упоминания этого имени внутри этого блока воспринимаются как обращения к текущему блоку. Это может приводить к ошибкам, когда в блоке имя используется до его обьявления. Это тонкое правило. Питон не страдает избытком деклараций и позволяет делать назначения именам в любом месте блока кода. Локальные для блока кода переменные определяются путём сканирования операций связывания имён по всему тексту блока.

source: If the :keyword:`global` statement occurs within a block, all uses of the name specified in the statement refer to the binding of that name in the top-level namespace. Names are resolved in the top-level namespace by searching the global namespace, i.e. the namespace of the module containing the code block, and the builtins namespace, the namespace of the module :mod:`builtins`. The global namespace is searched first. If the name is not found there, the builtins namespace is searched. The global statement must precede all uses of the name.
ru: Если инструкция «:keyword:`global`» встречается внутри блока, то все использования данного имени, определённого в данной инструкции, обращаются к тому, что назначено этому имени в области имён верхнего уровня. Значение имени сначала ищется в глобальной области имён – тоесть в области имён соответствующего модуля, содержащего данный блок кода, и, если не найдено, то затем ищется в области имён «:mod:`builtins`» этого модуля. Инструкция «:keyword:`global`» должна предшествовать всем упоминаниям данного имени.

source: The builtins namespace associated with the execution of a code block is actually found by looking up the name ``__builtins__`` in its global namespace; this should be a dictionary or a module (in the latter case the module's dictionary is used). By default, when in the :mod:`__main__` module, ``__builtins__`` is the built-in module :mod:`builtins`; when in any other module, ``__builtins__`` is an alias for the dictionary of the :mod:`builtins` module itself. ``__builtins__`` can be set to a user-created dictionary to create a weak form of restricted execution.
ru: Встроенная область имён, ассоциирующаяся с данным исполнением кода блока, в действительности ищется под именем «``__builtins__``» в его глобальной области имён – и это должен быть словарь или модуль (в последнем случае используется соответствующий словарь этого модуля) . По умолчанию, для модуля «:mod:`__main__`» – «``__builtins__``» – это встроенный модуль «:mod:`builtins`» , а для любого другого модуля – «``__builtins__``» – это псевдоним непосредственно словаря встроенного модуля «:mod:`builtins`» . «``__builtins__``» может быть словарём, определённым пользователем, чтобы создать слабую форму исполнения с ограничениями.

source: Users should not touch ``__builtins__``; it is strictly an implementation detail. Users wanting to override values in the builtins namespace should :keyword:`import` the :mod:`builtins` module and modify its attributes appropriately.
ru: Пользователи не должны влазить в «``__builtins__``» - его содержание - это исключительно детали реализации. Пользователи, желающие переопределить значения в этом встроенном пространстве имён должны импортировать модуль «:mod:`builtins`» и модифицировать соответственно его атрибуты.

source: The namespace for a module is automatically created the first time a module is imported. The main module for a script is always called :mod:`__main__`.
ru: Пространство имён для модуля автоматически создаётся, когда модуль в первый раз импортируется. Главный модуль скрипта всегда называется «:mod:`__main__`» .

source: The global statement has the same scope as a name binding operation in the same block. If the nearest enclosing scope for a free variable contains a global statement, the free variable is treated as a global.
ru: Инструкция «:keyword:`global`» остаётся в силе в тех же рамках, в каких действует связывание имени, произведённое в том же блоке. Если не связанная в данном блоке переменная (“свободная”) упоминается в нём в инструкции «:keyword:`global`» , то эта переменная считается глобальной.

source: A class definition is an executable statement that may use and define names. These references follow the normal rules for name resolution. The namespace of the class definition becomes the attribute dictionary of the class. Names defined at the class scope are not visible in methods.
ru: Описание (код) класса является исполнимым (в момент создания объекта класса) и может упоминать и создавать имена. В этом случае к именам применяются обычные правила интерпретации имён. Область имён самого́ объекта класса становится словарём атрибутов этого класса. Имена определённые в пределах класса не видимы в методах класса.

source: Interaction with dynamic features
ru: Взаимодействие с динамическими свойствами

source: There are several cases where Python statements are illegal when used in conjunction with nested scopes that contain free variables.
ru: Есть несколько случаев, в которых инструкции Питона являются недопустимыми при использовании совместно с вложенными блоками, содержащими не связанные там (“свободные”) переменные.

source: If a variable is referenced in an enclosing scope, it is illegal to delete the name. An error will be reported at compile time.
ru: Если переменная упоминается снаружи данного блока, то удалять её имя недопустимо. Это приведет к сообщению об ошибке на этапе компилирования.

source: If the wild card form of import --- ``import *`` --- is used in a function and the function contains or is a nested block with free variables, the compiler will raise a :exc:`SyntaxError`.
ru: Если в функции используется вариант импорта всего - «``import *``» , и эта функция содержит блок или содержится в блоке в котором есть свободная переменная, то компилятор выдаёт ошибку «:exc:`SyntaxError`» .

source: The :func:`eval` and :func:`exec` functions do not have access to the full environment for resolving names. Names may be resolved in the local and global namespaces of the caller. Free variables are not resolved in the nearest enclosing namespace, but in the global namespace. [#]_ The :func:`exec` and :func:`eval` functions have optional arguments to override the global and local namespace. If only one namespace is specified, it is used for both.
ru: Функции «:func:`eval`» и «:func:`exec`» не имеют доступа ко всему окружению для интерпретации имён. Значения имён могут искаться в локальной и в глобальной областях имён относительно места вызова. Свободные переменные не ищутся в области имён одним уровнем выше, за исключением глобальной. (Это ограничение происходит от того, что код, исполняемый этими инструкциями не доступен во время компиляции данного модуля.) Функции «:func:`eval`» и «:func:`exec`» имеют необязательные аргументы для переопределения глобальной и локальной областей имён. Если задан только один аргумент, то он используется для обеих областей.

source: Exceptions
ru: Исключения

source: Exceptions are a means of breaking out of the normal flow of control of a code block in order to handle errors or other exceptional conditions. An exception is *raised* at the point where the error is detected; it may be *handled* by the surrounding code block or by any code block that directly or indirectly invoked the code block where the error occurred.
ru: Исключения являются средством прерывания нормального хода исполнения кода для обработки ошибок или других исключительных ситуаций. Исключение возникает в месте, где обнаружена ошибка; оно может быть обработано в текущем блоке кода или в любом блоке кода, в котором прямо или косвенно вызван тот блок кода, который вызвал ошибку.

source: The Python interpreter raises an exception when it detects a run-time error (such as division by zero). A Python program can also explicitly raise an exception with the :keyword:`raise` statement. Exception handlers are specified with the :keyword:`try` ... :keyword:`except` statement. The :keyword:`finally` clause of such a statement can be used to specify cleanup code which does not handle the exception, but is executed whether an exception occurred or not in the preceding code.
ru: Интерпретатор Питона исполняет исключение, когда обнаруживает ошибку исполнения (например деление на ноль) . Программа на Питоне также может явно вызывать исключение инструкцией «:keyword:`raise`» . Обработчики исключений задаются инструкцией «:keyword:`try` ... :keyword:`except`» . Ветвь «:keyword:`finally`» этой инструкции может быть использована для задания кода, который исполняется независимо от того, произошло ли исключение в соответствующем блоке «:keyword:`try` ... :keyword:`except`» ( и которая не является функцией, получающей как аргумент идентификатор ошибки, и не является собственно обработчиком ошибки) .

source: Python uses the "termination" model of error handling: an exception handler can find out what happened and continue execution at an outer level, but it cannot repair the cause of the error and retry the failing operation (except by re-entering the offending piece of code from the top).
ru: Питон использует “ограничительную” модель обработки ошибок: обработчик исключения может проанализировать ситуацию и продолжить исполнение за пределами блока «:keyword:`try` ... :keyword:`except`» , но не может исправить причину ошибки и всё-таки выполнить сбойную операцию (не считая того, чтобы вызвать весь проблемный фрагмент с самого начала) .

source: When an exception is not handled at all, the interpreter terminates execution of the program, or returns to its interactive main loop. In either case, it prints a stack backtrace, except when the exception is :exc:`SystemExit`.
ru: Если для какой-то ошибки вообще не оказалось обработчика - интерпретатор прекращает выполнение данной программы или переходит к новому циклу - в случае интерактивного общения. В любом случае он выдаёт обратную раскрутку стека (“stack backtrace”) , кроме сучая исключения «:exc:`SystemExit`» .

source: Exceptions are identified by class instances. The :keyword:`except` clause is selected depending on the class of the instance: it must reference the class of the instance or a base class thereof. The instance can be received by the handler and can carry additional information about the exceptional condition.
ru: При исключительной ситуации для её обозначения создаётся экземпляр соответствующего класса ошибки. Обработчик (ветвь «:keyword:`except`») вызывается, если в нём указан класс или один из базовых классов произошедшей ошибки. Экземпляр класса ошибки может быть получен обработчиком и может содержать дополнительную информацию о ситуации ошибки.

source: Exception messages are not part of the Python API. Their contents may change from one version of Python to the next without warning and should not be relied on by code which will run under multiple versions of the interpreter.
ru: Сообщения о исключениях не являются частью API Питона. Их содержание может меняться от одной версии Питона к другой без предупреждения и код, который будет запускаться на разных версиях интерпретатора не должен полагаться на них.

source: See also the description of the :keyword:`try` statement in section :ref:`try` and :keyword:`raise` statement in section :ref:`raise`.
ru: Также, смотрите разделы «Инструкция “:ref:`try`” » и «Инструкция “:ref:`raise`” » .

source: Expressions
ru: Выражения

source: This chapter explains the meaning of the elements of expressions in Python.
ru: Этот раздел разъясняет значение элементов выражений на Питоне.

source: **Syntax Notes:** In this and the following chapters, extended BNF notation will be used to describe syntax, not lexical analysis. When (one alternative of) a syntax rule has the form
ru: **Замечание о синтаксисе:** В этом и следующем разделах расширенная нотация BNF будет использоваться для описания синтаксиса, а не для лексического анализа. Когда (как одна из альтернатив) синтактическое правило имеет форму

source: and no semantics are given, the semantics of this form of ``name`` are the same as for ``othername``.
ru: и не даётся дальнейшей расшифровки, то такая формулировка подразумевает, что ``name`` значит то же, что и ``othername`` .

source: Arithmetic conversions
ru: Арифметические преобразования

source: When a description of an arithmetic operator below uses the phrase "the numeric arguments are converted to a common type," this means that the operator implementation for built-in types works that way:
ru: Когда далее в описании арифметического оператора используется фраза “числовые аргументы преобразуются к общему типу” - это значит, что реализация операторов для встроенных типов работает следующим образом:

source: If either argument is a complex number, the other is converted to complex;
ru: Если любой из аргументов является комплексным числом, то другое преобразуется к комплексному;

source: otherwise, if either argument is a floating point number, the other is converted to floating point;
ru: иначе, если любой из аргументов является числом “с плавающею точкой” , то другое преобразуется к этому типу;

source: otherwise, both must be integers and no conversion is necessary.
ru: иначе – оба числа неизбежно целые, и никакого преобразования не требуется.

source: Atoms
ru: Атомы

source: Atoms are the most basic elements of expressions. The simplest atoms are identifiers or literals. Forms enclosed in parentheses, brackets or braces are also categorized syntactically as atoms. The syntax for atoms is:
ru: Атомы являются самыми базовыми (наименьшими) элементами выражений. Простейшими атомами являются идентификаторы и непосредственная запись данных (“литералы”) . Формации заключённые в круглые, квадратные или фигурные скобки - тоже синтаксически относятся к атомам. Синтаксис атомов :

source: Identifiers (Names)
ru: Идентификаторы (имена)

source: An identifier occurring as an atom is a name. See section :ref:`identifiers` for lexical definition and section :ref:`naming` for documentation of naming and binding.
ru: Идентификатор в роли атома является именем. Смотрите лексическое определение в разделе “Идентификаторы и ключевые слова” :ref:`identifiers` , а также документацию по именованию и связыванию в разделе “Именование и связывание” :ref:`naming` .

source: When the name is bound to an object, evaluation of the atom yields that object. When a name is not bound, an attempt to evaluate it raises a :exc:`NameError` exception.
ru: Когда данное имя назначено обьекту - интерпретация этого атома даёт этот обьект. Когда имя не назначено чему-либо - попытка интерпретировать его вызывает исключение «:exc:`NameError`» .

source: **Private name mangling:** When an identifier that textually occurs in a class definition begins with two or more underscore characters and does not end in two or more underscores, it is considered a :dfn:`private name` of that class. Private names are transformed to a longer form before code is generated for them. The transformation inserts the class name in front of the name, with leading underscores removed, and a single underscore inserted in front of the class name. For example, the identifier ``__spam`` occurring in a class named ``Ham`` will be transformed to ``_Ham__spam``. This transformation is independent of the syntactical context in which the identifier is used. If the transformed name is extremely long (longer than 255 characters), implementation defined truncation may happen. If the class name consists only of underscores, no transformation is done.
ru: Модифицирование локальных (частных) имён : Когда идентификатор, встретившийся в тексте определения класса, начинается с двух или более символов подчёркивания и не оканчивается двумя или более символами подчёркивания – он считается частным именем («:dfn:`private name`») данного класса. Частные имена заменяются на их длинную форму при генерации соответствующего кода. Эти длинные формы образуются добавлением в начале имени класса, у которого удаляются все подчёркивания в начале и ставится одно подчёркивание. Например : идентификатор «``__spam``» в классе «``Ham``» будет преобразован в «``_Ham__spam``» . Это преобразование не зависит от синтаксического контекста, в котором идентификатор был использован. Следует помнить, что в некоторых реализациях Питона может происходить обрезание имён, больших определённой длинны. Имена, состоящие только из подчёркиваний – не модифицируются.

source: Literals
ru: Непосредственная запись данных (константы, “литералы”)

source: Python supports string and bytes literals and various numeric literals:
ru: Питон поддерживает явную запись значений (константы) для текстов, байтов и различных типов чисел :

source: Evaluation of a literal yields an object of the given type (string, bytes, integer, floating point number, complex number) with the given value. The value may be approximated in the case of floating point and imaginary (complex) literals. See section :ref:`literals` for details.
ru: Интерпретирование явной записи даёт в результате объект соответствующего типа (текст, байты, целое, с плавающей запятой, комплексное числа) с данным значением. В случае констант дробных и комплексных чисел значение может быть установлено приблизительно.

source: With the exception of bytes literals, these all correspond to immutable data types, and hence the object's identity is less important than its value. Multiple evaluations of literals with the same value (either the same occurrence in the program text or a different occurrence) may obtain the same object or a different object with the same value.
ru: За исключением байтов – все они, по сути, соответствуют неизменяемым типам данных, и поэтому контроль идентичности такого объекта менее важен, чем значение объекта. Многократные упоминания явных записей с одинаковым значением (будь то многократный проход одного места программы или в разных местах) могут получать как тот же объект так и другой объект с таким же значением.

source: Parenthesized forms
ru: Формы в скобках

source: A parenthesized form is an optional expression list enclosed in parentheses:
ru: Формы в скобках – это необязательный список выражений, заключённый в скобки :

source: An empty pair of parentheses yields an empty tuple object. Since tuples are immutable, the rules for literals apply (i.e., two occurrences of the empty tuple may or may not yield the same object).
ru: Пустая пара скобок даёт объект - пустй кортеж. Поскольку кортежи являются неизменяемыми, то к ним применяются правила для констант (тоесть, два упоминания пустых кортежей могут получать как тот же объект так и другой объект с таким же значением) .

source: Note that tuples are not formed by the parentheses, but rather by use of the comma operator. The exception is the empty tuple, for which parentheses *are* required --- allowing unparenthesized "nothing" in expressions would cause ambiguities and allow common typos to pass uncaught.
ru: Заметьте, что кортежи образуются не скобками, а использованием оператора запятая. Исключением является пустой кортеж, для которого пустые скобки *обязательны* (без которых могли бы возникать неоднозначности, и опечатки могли бы оставаться незамеченными) .

source: Displays for lists, sets and dictionaries
ru: Отображения для списков, наборов и словарей

source: For constructing a list, a set or a dictionary Python provides special syntax called "displays", each of them in two flavors:
ru: Для создания списков, наборов и словарей Питон предоставляет специальный синтаксис, называемый отображения “:term:`display`s” , для каждого в двух вариантах :

source: either the container contents are listed explicitly, or
ru: либо их содержимое перечисляется явно, либо

source: Common syntax elements for comprehensions are:
ru: Общий синтаксис “сборок” :

source: The comprehension consists of a single expression followed by at least one :keyword:`for` clause and zero or more :keyword:`for` or :keyword:`if` clauses. In this case, the elements of the new container are those that would be produced by considering each of the :keyword:`for` or :keyword:`if` clauses a block, nesting from left to right, and evaluating the expression to produce an element each time the innermost block is reached.
ru: “Компоновка” состоит из одного выражения, после которого идёт минимум одно ключевое слово «:keyword:`for`» после которого могут быть в любом количестве ключевые слова «:keyword:`for`» или «:keyword:`if`» . В случае, если таковые присутствуют, содержимое группы очередного из них – это то, что получается, если считать каждую группу «:keyword:`for`» или «:keyword:`if`» блоком, вложенным по отношению к тому, что левее, и интерпретировать это выражение, получая очередной элемент каждый раз, дойдя до самого внутреннего блока.
